updated k8s notes
